#ifndef STRINGS_H
#define STRINGS_H

#define length 80
#define ui_info_text "╔════════════════════════════════════════════════════════════════════════════════════════════════╗\n" \
                     "║>> Выбор входного файла введите: `i<Enter>`                                                     ║\n" \
                     "║   └─ Входной файл:  %-72s   ║ \n" \
                     "║                    ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾  ║\n" \
                     "║>> Выбор выходного файла введите: `o<Enter>` (можно указать несуществующий, он создастся)       ║\n" \
                     "║   └─ Выходной файл:  %-71s   ║ \n" \
                     "║                     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾  ║\n" \
                     "║>> Для старта введите: `s<Enter>`                                                               ║\n" \
                     "║                                                                                                ║\n" \
                     "║>> Для выхода введите: `exit<Enter>`                                                            ║\n" \
                     "╚════════════════════════════════════════════════════════════════════════════════════════════════╝\n  "
#endif
